lwIoT/lwiot-atmega/external/lib_ext_ram/ramfs.c
/*------------------------------------------------------------------------*/


uint8_t ramfs_transfer_block(pRAMFSarray pRAMFS_block, uint8_t *data)
{
	uint16_t index;
	uint8_t TxByte, RxByte, TxRxByte;
	uint8_t * pRAM;

	pRAM = (uint8_t *) pRAMFS_block; // make this cast to serialise the Command structure.

	ramfs_transaction_init();	// set up the SPI bus for the RAMFS transaction.
								// this is VERY time critical, so we do it in a MACRO to ensure there is no loss of time.
								// Note unpaired in this function: taskENTER_CRITICAL();

	index = 0;
	SPDR = pRAM[ index++ ]; 							// Begin transmission of the command structure (serialised)

	while( index < sizeof(xRAMFSarray) )
	{
		TxByte = pRAM[ index++ ]; 						// pre-load the byte to be transmitted
		if( CHECK_FOR_MY_SS ) break;
		while( WAIT_FOR_SPIF );

		SPDR = TxByte; 									// Continue transmission of the command structure
	}

	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return 0;
	}
	while( WAIT_FOR_SPIF );

	index = 0;
	// now we have sent the command structure, the Supervisor will know what to do with the data.
	switch( pRAMFS_block->ram_cmd )
	{
		case Read :

			SPDR  = 0xFF;								// prepare a dummy byte.
			while( index < pRAMFS_block->ram_size - 1 )
			{
				if( CHECK_FOR_MY_SS ) break;
				while( WAIT_FOR_SPIF );

				RxByte = SPDR; 							// copy received byte
				SPDR = 0xFF;   							// Continue dummy byte transmission
				data [ index++ ] = RxByte;
			}
			if( CHECK_FOR_MY_SS ) break;
			while( WAIT_FOR_SPIF );

			RxByte = SPDR; 								// copy last received byte
			SPDR = 0xA5;								// make the check byte available
			data [ index ] = RxByte;					// store the last data byte that was read
			if( CHECK_FOR_MY_SS ) break;
			while( WAIT_FOR_SPIF );

			RxByte = SPDR;								// store the check byte
			break;

		case Write :

			SPDR = data[ index++ ]; 					// Begin transmission
			while( index < pRAMFS_block->ram_size )
			{
				TxByte = data[ index++ ]; 				// pre-load the byte to be transmitted
				if( CHECK_FOR_MY_SS ) break;
				while( WAIT_FOR_SPIF );

				SPDR = TxByte; 							// Continue transmission
			}
			if( CHECK_FOR_MY_SS ) break;
			while( WAIT_FOR_SPIF );

			SPDR = 0xA5;								// make the check byte available
			if( CHECK_FOR_MY_SS ) break;
			while( WAIT_FOR_SPIF );

			RxByte = SPDR;								// store the check byte
			break;

		case Swap :

			SPDR = data[ index ]; 						// Begin first byte transfer
			while( index < pRAMFS_block->ram_size - 1)
			{
				TxByte = data[ index + 1 ]; 			// pre-load the next byte to be transmitted, while transferring
				if( CHECK_FOR_MY_SS ) break;
				while( WAIT_FOR_SPIF );

				RxByte = SPDR; 							// copy received byte
				SPDR = TxByte; 							// Continue transmission
				data [ index++ ] = RxByte;				// store the byte that was read, while transferring
			}
			if( CHECK_FOR_MY_SS ) break;
			while( WAIT_FOR_SPIF );

			RxByte = SPDR; 								// copy last received byte
			SPDR = 0xA5;								// make the check byte available
			data [ index ] = RxByte;					// store the last data byte that was read
			if( CHECK_FOR_MY_SS ) break;
			while( WAIT_FOR_SPIF );

			RxByte = SPDR;								// store the check byte
			break;

		case Test :
		case Huh :
		default :
			break;
	}

	spiSlaveEnd();										// clean up the SPI bus for other Clients.
	taskEXIT_CRITICAL();								// turn on interrupts

	if( RxByte == 0x5A) 								// compare if the returned check byte is as expected?
		return 0;										// return success!

	return 1;
}

/*-----------------------------------------------------------*/

size_t vRAMFSMalloc( size_t xWantedSize )
{
size_t vReturn = 0;


	/* Check there is enough room left for the allocation. */
	if( ( ( xNextFreeRAMFSByte + xWantedSize ) < configTOTAL_RAMFS_SIZE ) &&
		( ( xNextFreeRAMFSByte + xWantedSize ) > xNextFreeRAMFSByte )	)/* Check for overflow. */
	{
		/* Return the next free byte then increment the index past this
		block. */
		vReturn = (size_t) XRAMSTART + xNextFreeRAMFSByte;
		xNextFreeRAMFSByte += xWantedSize;
	}

	#if( configUSE_MALLOC_FAILED_HOOK == 1 )
	{
		if( pvReturn == NULL )
		{
			extern void vApplicationMallocFailedHook( void );
			vApplicationMallocFailedHook();
		}
	}
	#endif

	return vReturn;
}
/*-----------------------------------------------------------*/

void vRAMFSFree( size_t v )
{
	/* Memory cannot be freed using this scheme. */
	v = 0;

	/* Force an assert as it is invalid to call this function. */
	configASSERT( pv == NULL );
}
/*-----------------------------------------------------------*/

void vRAMFSInitialiseBlocks( void )
{
	/* Only required when static memory is not cleared. */
	xNextFreeRAMFSByte = ( size_t ) 0;
}
/*-----------------------------------------------------------*/

size_t xRAMFSGetFreeSize( void )
{
	return ( configTOTAL_RAMFS_SIZE - xNextFreeRAMFSByte );
}
/*-----------------------------------------------------------*/



/*----------------------------------------------------------------------*/
/* Public disk control functions for use by ff.c - do not use directly  */
/*----------------------------------------------------------------------*/

DSTATUS disk_status (uint8_t pdrv)
{
	uint16_t index;
	uint8_t TxRxByte;
	DSTATUS diskStatus;
	xRAMFSarray xRAMFS_block;			// this is just an array for XRAMFS info.
	uint8_t * pRAM;

	if (pdrv) return STA_NOINIT;		// Supports only single drive, drive 0.

	xRAMFS_block.ram_cmd  = Disk_Status;
	xRAMFS_block.ram_addr = (size_t) (XRAMSTART + xNextFreeRAMFSByte); // Set to a valid address, not used.
	xRAMFS_block.ram_size = (uint16_t) 1;	// Set to a valid size, not used.

	pRAM = (uint8_t *) &xRAMFS_block;	// make this cast to serialise the Command structure.

	ramfs_transaction_init();	// set up the SPI bus for the RAMFS transaction.
								// this is VERY time critical, so we do it in a MACRO to ensure there is no loss of time.
								// Note unpaired in this function: taskENTER_CRITICAL();

	index = 0;
	SPDR = pRAM[ index++ ]; 				// Begin transmission of the command structure (serialised)

	while( index < sizeof(xRAMFSarray) )
	{
		TxRxByte = pRAM[ index++ ]; 		// pre-load the byte to be transmitted
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return STA_NOINIT;
		}
		while( WAIT_FOR_SPIF );

		SPDR = TxRxByte; 					// Continue transmission of the command structure
	}

	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return STA_NOINIT;
	}
	while( WAIT_FOR_SPIF );

	// now we have sent the command structure, the Supervisor will know what to do for us.

	SPDR  = 0xFF;							// prepare a dummy byte.

	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return STA_NOINIT;
	}
	while( WAIT_FOR_SPIF );
	TxRxByte = SPDR; 						// copy received byte

	SPDR = 0xA5;							// make the check byte available
	diskStatus = TxRxByte;					// store the disk status

	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return STA_NOINIT;
	}
	while( WAIT_FOR_SPIF );
	TxRxByte = SPDR;							// store the check byte

	spiSlaveEnd();								// clean up the SPI bus for other Clients.
	taskEXIT_CRITICAL();						// turn on interrupts

	if( TxRxByte == 0x5A) 						// compare if the returned check byte is as expected?
		return diskStatus;						// return success in the form of the diskStatus!

	return STA_NOINIT;
}


DSTATUS disk_initialize (uint8_t pdrv)
{
	uint16_t index;
	uint8_t TxRxByte;
	DSTATUS diskStatus;
	xRAMFSarray xRAMFS_block;			// this is just an array for XRAMFS info.
	uint8_t * pRAM;

	if (pdrv) return STA_NOINIT;		// Supports only single drive, drive 0.

	xRAMFS_block.ram_cmd  = Disk_Init;
	xRAMFS_block.ram_addr = (size_t) (XRAMSTART + xNextFreeRAMFSByte); // Set to a valid address, not used.
	xRAMFS_block.ram_size = (uint16_t) 1;	// Set to a valid size, not used.

