lwIoT/lwiot-atmega/external/lib_ext_ram/ramfs.c
	pRAM = (uint8_t *) &xRAMFS_block; 	// make this cast to serialise the Command structure.

	ramfs_transaction_init();	// set up the SPI bus for the RAMFS transaction.
								// this is VERY time critical, so we do it in a MACRO to ensure there is no loss of time.
								// Note unpaired in this function: taskENTER_CRITICAL();

	index = 0;
	SPDR = pRAM[ index++ ]; 					// Begin transmission of the command structure (serialised)

	while( index < sizeof(xRAMFSarray) )
	{
		TxRxByte = pRAM[ index++ ]; 			// pre-load the byte to be transmitted
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return STA_NOINIT;
		}
		while( WAIT_FOR_SPIF );

		SPDR = TxRxByte; 						// Continue transmission of the command structure
	}

	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return STA_NOINIT;
	}
	while( WAIT_FOR_SPIF );

	// now we have sent the command structure, the Supervisor will know what to do with the data.

	SPDR  = 0xFF;								// prepare a dummy byte.
	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return STA_NOINIT;
	}
	while( WAIT_FOR_SPIF );
	TxRxByte = SPDR; 							// copy received byte

	SPDR = 0xA5;								// make the check byte available
	diskStatus = TxRxByte;						// store the data byte that was read
	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return STA_NOINIT;
	}
	while( WAIT_FOR_SPIF );

	TxRxByte = SPDR;							// store the check byte

	spiSlaveEnd();								// clean up the SPI bus for other Clients.
	taskEXIT_CRITICAL();						// turn on interrupts

	if( TxRxByte != 0x5A) 						// compare if the returned check byte is as expected?
		return STA_NOINIT;

	return diskStatus;							// return the result!
}


DRESULT disk_read (uint8_t pdrv, uint8_t* buff, uint32_t sector, uint8_t count)
{
	uint16_t index;
	uint8_t TxRxByte;
	xRAMFSarray xRAMFS_block;			// this is just an array for XRAMFS info.
	uint8_t * pRAM;

	if (pdrv || !count) return RES_PARERR;	// Supports only single drive, drive 0.

	xRAMFS_block.ram_cmd  = Disk_Read;
	xRAMFS_block.ram_addr = (size_t) (XRAMSTART + xNextFreeRAMFSByte); // Set to a valid address
	xRAMFS_block.ram_size = count * 512;	// Set to a valid size
	xRAMFS_block.disk_sector = sector;
	xRAMFS_block.disk_sector_count = count;

	pRAM = (uint8_t *) &xRAMFS_block;	// make this cast to serialise the Command structure.


	do {
		ramfs_transaction_init();	// set up the SPI bus for the RAMFS transaction.
									// this is VERY time critical, so we do it in a MACRO to ensure there is no loss of time.
									// Note unpaired in this function: taskENTER_CRITICAL();
		index = 0;
		SPDR = pRAM[ index++ ]; 				// Begin transmission of the command structure (serialised)

		while( index < sizeof(xRAMFSarray) )
		{
			TxRxByte = pRAM[ index++ ]; 		// pre-load the byte to be transmitted
			if( CHECK_FOR_MY_SS )
			{
				spiSlaveEnd();
				taskEXIT_CRITICAL();
				return RES_NOTRDY;
			}
			while( WAIT_FOR_SPIF );

			SPDR = TxRxByte; 					// Continue transmission of the command structure
		}

		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_NOTRDY;
		}
		while( WAIT_FOR_SPIF );

		index = 0;
		// now we have sent the command structure, the Supervisor will know what to do with the data.

		SPDR  = 0xFF;							// prepare a dummy byte.
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_ERROR;
		}
		while( WAIT_FOR_SPIF );

		TxRxByte = SPDR; 						// copy received byte

		if (TxRxByte & STA_NOINIT)				// If the disk_status is not initialised, then return error.
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_ERROR;
		}

		SPDR = 0xFF;   							// Continue dummy byte transmission
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_ERROR;
		}
		while( WAIT_FOR_SPIF );

		TxRxByte = SPDR; 						// copy last_command_result byte

		if (TxRxByte == RES_PENDING) break;		// we're on the second loop, and the data is waiting for us to get from XRAM.

		SPDR = 0xA5;							// make the check byte available
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_ERROR;
		}
		while( WAIT_FOR_SPIF );

		TxRxByte = SPDR;						// store the check byte

		spiSlaveEnd();							// clean up the SPI bus for other Clients.
		taskEXIT_CRITICAL();					// turn on interrupts

		if( TxRxByte != 0x5A) 					// compare if the returned check byte is as expected we can proceed.
			return RES_ERROR;

	}while (TxRxByte != RES_PENDING);

	SPDR  = 0xFF;								// prepare a dummy byte.
	while( index < xRAMFS_block.ram_size - 1 )
	{
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_ERROR;
		}
		while( WAIT_FOR_SPIF );

		TxRxByte = SPDR; 						// copy received byte
		SPDR = 0xFF;   							// Continue dummy byte transmission

		buff[ index++ ] = TxRxByte;
	}
	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return RES_ERROR;
	}
	while( WAIT_FOR_SPIF );

	TxRxByte = SPDR; 							// copy last received byte
	SPDR = 0xA5;								// make the check byte available

	buff[ index ] = TxRxByte;					// store the last data byte that was read

	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return RES_ERROR;
	}
	while( WAIT_FOR_SPIF );

	TxRxByte = SPDR;							// store the check byte

	spiSlaveEnd();								// clean up the SPI bus for other Clients.
	taskEXIT_CRITICAL();						// turn on interrupts

	if( TxRxByte == 0x5A) 						// compare if the returned check byte is as expected?
		return RES_OK;							// return success!

	return RES_ERROR;
}

DRESULT disk_write (uint8_t pdrv, const uint8_t* buff, uint32_t sector, uint8_t count)
{
	uint16_t index;
	uint8_t TxRxByte;
	xRAMFSarray xRAMFS_block;			// this is just an array for XRAMFS info.
	uint8_t * pRAM;

