lwIoT/lwiot-atmega/external/lib_ext_ram/ramfs.c
	if (pdrv || !count) return RES_PARERR;	// Supports only single drive, drive 0.

	xRAMFS_block.ram_cmd  = Disk_Write;
	xRAMFS_block.ram_addr = (size_t) (XRAMSTART + xNextFreeRAMFSByte); // Set to a valid address
	xRAMFS_block.ram_size = count * 512;	// Set to a valid size
	xRAMFS_block.disk_sector = sector;
	xRAMFS_block.disk_sector_count = count;

	pRAM = (uint8_t *) &xRAMFS_block;	// make this cast to serialise the Command structure.

	ramfs_transaction_init();	// set up the SPI bus for the RAMFS transaction.
								// this is VERY time critical, so we do it in a MACRO to ensure there is no loss of time.
								// Note unpaired in this function: taskENTER_CRITICAL();

	index = 0;
	SPDR = pRAM[ index++ ]; 							// Begin transmission of the command structure (serialised)

	while( index < sizeof(xRAMFSarray) )
	{
		TxRxByte = pRAM[ index++ ]; 						// pre-load the byte to be transmitted
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_NOTRDY;
		}
		while( WAIT_FOR_SPIF );

		SPDR = TxRxByte; 									// Continue transmission of the command structure
	}

	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return RES_NOTRDY;
	}
	while( WAIT_FOR_SPIF );

	index = 0;
	// now we have sent the command structure, the Supervisor will know what to do with the data.

	SPDR = buff[ index++ ]; 					// Begin transmission
	while( index < xRAMFS_block.ram_size )
	{
		TxRxByte = buff[ index++ ]; 				// pre-load the byte to be transmitted
		if( CHECK_FOR_MY_SS ) return RES_ERROR;
		while( WAIT_FOR_SPIF );

		SPDR = TxRxByte; 							// Continue transmission
	}
	if( CHECK_FOR_MY_SS ) return RES_ERROR;
	while( WAIT_FOR_SPIF );

	SPDR = 0xA5;								// make the check byte available
	if( CHECK_FOR_MY_SS ) return RES_ERROR;
	while( WAIT_FOR_SPIF );

	TxRxByte = SPDR;								// store the check byte

	spiSlaveEnd();										// clean up the SPI bus for other Clients.
	taskEXIT_CRITICAL();								// turn on interrupts

	if( TxRxByte == 0x5A) 								// compare if the returned check byte is as expected?
		return RES_OK;									// return success!

	return RES_ERROR;
}

DRESULT disk_ioctl (uint8_t pdrv, uint8_t cmd, void* buff)
{
	uint16_t index;
	uint8_t TxRxByte;
	xRAMFSarray xRAMFS_block;			// this is just an array for XRAMFS info.
	uint8_t* pRAM;

	if (pdrv) return RES_PARERR;		// Supports only single drive, drive 0.

	xRAMFS_block.ram_cmd  = Disk_IOCtl;
	xRAMFS_block.ram_addr = (size_t) (XRAMSTART + xNextFreeRAMFSByte); // Set to a valid address
	xRAMFS_block.disk_sector_count = cmd;		// note REUSE of the disk_sector_count for carrying the specific IOCtl command.

	switch (cmd) {				/* Set the response size based on the type of cmd we're executing */

	case CTRL_POWER :			/* No Response Needed, Supervisor looks after the SD card. */
	case CTRL_ERASE_SECTOR :	/* No Response Needed, don't bother implement this. It is slow and unnecessary. */

		return RES_OK;
		break;

	case CTRL_SYNC :			/* No Response provided, so we're just going to set this to small as possible */

		xRAMFS_block.ram_size = sizeof(uint8_t);	// Set to a valid size of uint8_t
		break;

	case GET_SECTOR_SIZE :		/* Get R/W sector size (uint16_t) */

		xRAMFS_block.ram_size = sizeof(uint16_t);	// Set to a valid size of uint16_t
		break;

	case GET_SECTOR_COUNT :		/* Get number of sectors on the disk (uint32_t) */
	case GET_BLOCK_SIZE :		/* Get erase block size in unit of sector (uint32_t) */

		xRAMFS_block.ram_size = sizeof(uint32_t);	// Set to a valid size of uint32_t
		break;

	case MMC_GET_TYPE :			/* Get card type flags (1 byte) */

		xRAMFS_block.ram_size = sizeof(uint8_t);	// Set to a valid size of uint8_t
		break;

	case MMC_GET_CSD :			/* Receive CSD as a data block (16 bytes) */
	case MMC_GET_CID :			/* Receive CID as a data block (16 bytes) */

		xRAMFS_block.ram_size = 16 * sizeof(uint8_t);	// Set to a valid size of 16 bytes
		break;

	case MMC_GET_OCR :			/* Receive OCR as an R3 response (4 bytes) */

		xRAMFS_block.ram_size = 4 * sizeof(uint8_t);	// Set to a valid size of 4 bytes
		break;

	case MMC_GET_SDSTAT :		/* Receive SD status as a data block (64 bytes) */

		xRAMFS_block.ram_size = 64 * sizeof(uint8_t);	// Set to a valid size of 64 bytes
		break;

	default:
		return RES_PARERR;
		break;
	}

	pRAM = (uint8_t *) &xRAMFS_block;			// make this cast to serialise the Command structure.

	do {
		ramfs_transaction_init();	// set up the SPI bus for the RAMFS transaction.
									// this is VERY time critical, so we do it in a MACRO to ensure there is no loss of time.
									// Note unpaired in this function: taskENTER_CRITICAL();
		index = 0;
		SPDR = pRAM[ index++ ]; 				// Begin transmission of the command structure (serialised)

		while( index < sizeof(xRAMFSarray) )
		{
			TxRxByte = pRAM[ index++ ]; 		// pre-load the byte to be transmitted
			if( CHECK_FOR_MY_SS )
			{
				spiSlaveEnd();
				taskEXIT_CRITICAL();
				return RES_NOTRDY;
			}
			while( WAIT_FOR_SPIF );

			SPDR = TxRxByte; 					// Continue transmission of the command structure
		}

		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_NOTRDY;
		}
		while( WAIT_FOR_SPIF );

		index = 0;
		// now we have sent the command structure, the Supervisor will know what to do with the data.

		SPDR  = 0xFF;							// prepare a dummy byte.
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_NOTRDY;
		}
		while( WAIT_FOR_SPIF );

		TxRxByte = SPDR; 						// copy received byte

		if (TxRxByte & STA_NOINIT)				// If the disk_status is not initialised, then return error.
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_NOTRDY;
		}

		SPDR = 0xFF;   							// Continue dummy byte transmission
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_NOTRDY;
		}
		while( WAIT_FOR_SPIF );

		TxRxByte = SPDR; 						// copy last_command_result byte

		if (TxRxByte == RES_PENDING) break;		// we're on the second loop, and the data is waiting for us to get from XRAM.

		SPDR = 0xA5;							// make the check byte available
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_NOTRDY;
		}
		while( WAIT_FOR_SPIF );

