lwIoT/lwiot-atmega/external/lib_ext_ram/ramfs.c
		TxRxByte = SPDR;						// store the check byte

		spiSlaveEnd();							// clean up the SPI bus for other Clients.
		taskEXIT_CRITICAL();					// turn on interrupts

		if( TxRxByte != 0x5A) 					// compare if the returned check byte is as expected we can proceed.
			return RES_NOTRDY;


	}while (TxRxByte != RES_PENDING);

	SPDR  = 0xFF;								// prepare a dummy byte.
	while( index < xRAMFS_block.ram_size - 1 )
	{
		if( CHECK_FOR_MY_SS )
		{
			spiSlaveEnd();
			taskEXIT_CRITICAL();
			return RES_NOTRDY;
		}
		while( WAIT_FOR_SPIF );

		TxRxByte = SPDR; 						// copy received byte
		SPDR = 0xFF;   							// Continue dummy byte transmission

		((uint8_t *)buff)[ index++ ] = TxRxByte;
	}
	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return RES_NOTRDY;
	}
	while( WAIT_FOR_SPIF );

	TxRxByte = SPDR; 							// copy last received byte
	SPDR = 0xA5;								// make the check byte available

	((uint8_t *)buff)[ index ] = TxRxByte;		// store the last data byte that was read

	if( CHECK_FOR_MY_SS )
	{
		spiSlaveEnd();
		taskEXIT_CRITICAL();
		return RES_NOTRDY;
	}
	while( WAIT_FOR_SPIF );

	TxRxByte = SPDR;							// store the check byte

	spiSlaveEnd();								// clean up the SPI bus for other Clients.
	taskEXIT_CRITICAL();						// turn on interrupts

	if( TxRxByte == 0x5A) 						// compare if the returned check byte is as expected?
		return RES_OK;							// return success!

	return RES_ERROR;
}

/*-----------------------------------------------------------*/

// */
#endif



// ********** Supervisor Interrupt Handlers ********** //

#if defined(__AVR_ATmega640__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega1281__) || defined(__AVR_ATmega2560__) || defined(__AVR_ATmega2561__)
/****************************************************************************
This function is the Interrupt Service Routine (ISR), and called when a SS pin change interrupt is triggered;
indicating that a client device wants to be serviced.
This function should not be called directly from the main application.
****************************************************************************/

#if defined (ARDUSAT_HARDWARE) // Most of the PCINT1 pins are unavailable on the Mega2650

ISR (PCINT1_vect)
{
    uint16_t changedbits;
	signed portBASE_TYPE xHigherPriorityTaskWoken;

    changedbits = (uint16_t)(( PINJ<<1 | (PINE & 0x01) ) ^ HIGH_BITS);	// Check if any of the SS lines from Clients have been pulled low.

    if (changedbits != 0x0000)
		// Push changedbits onto the queue for later processing.
		// Don't wait if queue full.
		xQueueSendToBackFromISR( xRAMFSCallQueue, &changedbits, &xHigherPriorityTaskWoken );

	if( xHigherPriorityTaskWoken )
		taskYIELD ();
}
#endif

ISR (PCINT2_vect)
{
    uint16_t changedbits;
	signed portBASE_TYPE xHigherPriorityTaskWoken;

	// calculate which bit changed since last time
    changedbits = ((uint16_t)(PINK ^ HIGH_BITS)) << 8;	// Check if any of the SS lines from Clients have been pulled low.

    if (changedbits != 0x0000)
		// Push changedbits onto the queue for later processing.
		// Don't wait if queue full.
		xQueueSendToBackFromISR( xRAMFSCallQueue, &changedbits, &xHigherPriorityTaskWoken );

	if( xHigherPriorityTaskWoken )
		taskYIELD ();
}

#endif

#endif
